/*
반복문 : while , do while,  for
while : 일반적인 반복 (무한반복, 종료조건 반복)
do while : 처음에 무조건 1 회 실행 후 조건을 판단해서 반복 여부 결정
for : 일정한 횟수를 반복
	 for (초기식 ; 조건식 ; 증감식) {실행문}

반복문에는 index가 필요 ex : i j k l m ....

조건문 : 조건에 따라서 프로그램 실행을 다르게 할 때 사용
if문 switch 삼항식 등이 있다

if : if(조건식) {실행문}, 조건을 만족(true : 0이 아닌 것) 하면 실행. 조건 불만족 시 그냥 넘어가고 내려감.

조건이 여러개일 경우 else if 사용, 마지막에 그 밖에 나머지 조건들을 표현할 땐 else
if() else if() else()

삼항식 : 항이 3개

삼항식의 표현 : (조건식) ? 실행문1 : 실행문2;
				조건식이 만족(참)되면 실행문 1이 수행되고 불만족(거짓)되면 실행문 2가 수행됨.

switch(변수) {}
 case1:
 실행문1;
 break;

 case2:
 실행문2;
 break;

 default: if문의 other에 대응. 끝이기 때문에 break 있어도 되고 없어도 됨


*/
